[{
  "name": "高等数学",
  "content_1": "高等数学是比初等数学更高深的数学。有将中学里较深入的代数、几何以及集合论初步、逻辑初步统称为中等数学的，将其作为小学、初中的初等数学与本科阶段的高等数学之间的过渡。通常认为，高等数学的主要内容包括：极限理论、一元微积分学、多元微积分学、空间解析几何与向量代数、级数理论、常微分方程初步。在高等数学的教材中，以微积分学和级数理论为主体，其他方面的内容为辅，各类课本略有差异。",
  "content_2": "在中華人民共和國，理工科各类专业的学生（数学专业除外，数学专业学数学分析），学的深一些，课本常称“高等数学”，多数院校使用课本为同济大学数学系所编的《高等数学》；文史科各类专业的学生，学的浅一些，课本常称“微积分”。理工科的不同专业，文史科的不同专业，深浅程度又各不相同。研究变量的是高等数学，可高等数学并不只研究变量。至于与“高等数学”相伴的课程通常有：线性代数（数学专业学高等代数），概率论与数理统计（有些数学专业分开学）。",
  "content_3": "高等数学是高等学校理工科本科有关专业学生的一门必修的重要基础课。通过这门课程的学习，使学生获得向量代数与空间解析几何、微积分的基本知识，必要的基础理论和常用的运算方法，并注意培养学生的运算能力和初步的抽象思维、逻辑推理及空间想象能力，从而使学生获得解决实际问题能力的初步训练，为学习后继课程奠定必要的数学基础。",
  "content_4": "",
  "content_5": "",
  "content_6": ""
}, {
  "name": "线性代数",
  "content_1": "线性代数是关于向量空间和线性映射的一个数学分支。它包括对线、面和子空间的研究，同时也涉及到所有的向量空间的一般性质。",
  "content_2": "坐标满足线性方程的点集形成n维空间中的一个超平面。n个超平面相交于一点的条件是线性代数研究的一个重要焦点。此项研究源于包含多个未知数的线性方程组。这样的方程组可以很自然地表示为矩阵和向量的形式。",
  "content_3": "线性代数既是纯数学也是应用数学的核心。例如，放宽向量空间的公理就产生抽象代数，也就出现若干推广。泛函分析研究无穷维情形的向量空间理论。线性代数与微积分结合，使得微分方程线性系统的求解更加便利。线性代数的理论已被泛化为算子理论。",
  "content_4": "线性代数的方法还用在解析几何、工程、物理、自然科学、計算機科學、计算机动画和社会科学（尤其是经济学）中。由于线性代数是一套完善的理论，非线性数学模型通常可以被近似为线性模型。",
  "content_5": "",
  "content_6": ""
}, {
  "name": "模拟电路",
  "content_1": "模拟电路（英语：analogue electronics，美式：analog electronics）是涉及连续函数形式模拟信号的电子电路，与之相对的是数字电路，后者通常只关注0和1两个逻辑电平。“模拟”二字主要指电压（或电流）对于真实信号成比例的再现，它最初来源于希腊语词汇ανάλογος，意思是“成比例的”。",
  "content_2": "模拟电路系统处理的信号总是包含着一定的噪声。这意味着，电路系统随机的热偏差将造成模拟信号随机的偏差、扰动。模拟电路系统中各个不同部分的偏差积累起来，可以使偏差量的负面影响常常会比较显著，这些偏差将形成噪声。[2]由于模拟信号在电路中常常会通过电子放大器，噪声会被不断地放大，再加上原始信号在长距离传输的过程中也会有损耗，因此这些随机的噪声会造成信号严重失真。模拟电路中噪声的来源还来自于外部信号干扰以及设计欠佳的电子元件。通过使用屏蔽导线，或者在电路中引入低噪音放大器，可以尽量缓解噪声的负面影响。",
  "content_3": "在模拟电路和数字电路中，信号的表达方式不同。对模拟信号能够执行的操作，例如放大、滤波、限幅等，都可以对数字信号进行操作。事实上，所有的数字电路从根本上来说都是模拟电路，其基本电学原理，都与模拟电路相同。互補式金屬氧化物半導體就是由两个模拟的金屬氧化物半導體場效電晶體构成的，其对称、互补的结构，使它恰好能处理高低数字逻辑电平。不过，数字电路的设计目标是用来处理数字信号，如果强行引入任意模拟信号而不进行额外处理，则可能造成量化噪声。",
  "content_4": "在模拟电路中，由于信号几乎完全将真实信号按比例表现为电压或电流的形式，造成模拟电路对于噪声的影响比数字电路更加敏感，信号的微小偏差都会表现为相当显著，造成信息损失。作为对比，数字电路只取决于高低电平，如果要造成信息传递的错误，那么信号的偏差必须至少达到高电平的一半左右（具体的大小根据不同的电路规格有所不同）。因此，对信息进行量化的数字电路对于噪声的抵御能力比模拟电路更强，只要偏差不大于某一规定值，信息就不会损失。在数字电路中，噪声在各个逻辑门的地方都可以得到消减。",
  "content_5": "模拟电路的设计通常比数字电路更为困难，对设计人员的水平要求更高。这也是数字电路系统比模拟电路系统更加普及的原因之一。模拟电路通常需要更多的手工运算，其设计过程的自动化程度低于数字电路。然而，数字式电子设备要在真实物理世界中得到应用，就必须具有一个模拟的接口，因为自然界的大多数实际信号是模拟的。[7]例如，所有数字式收音机的信号接收器，都具有一个模拟的预放大器来进行信号接收的第一步操作。",
  "content_6": ""
}, {
  "name": "C语言",
  "content_1": "C是一种通用的程式語言，广泛用于系统软件与应用软件的开发。于1969年至1973年間，為了移植與開發UNIX作業系統，由丹尼斯·里奇與肯·汤普逊，以B语言为基础，在贝尔实验室設計、开发出來。",
  "content_2": "C语言具有高效、灵活、功能丰富、表达力强和較高的可移植性等特点，在程序员中备受青睐，成为最近25年使用最为广泛的编程语言[2]。目前，C语言編譯器普遍存在於各種不同的操作系统中，例如Microsoft Windows, Mac OS X, Linux, Unix等。C語言的設計影響了众多後來的程式語言，例如C++、Objective-C、Java、C#等。",
  "content_3": "二十世纪八十年代，為了避免各開發廠商用的C語言語法產生差異，由美國國家標準局為C語言訂定了一套完整的國際標準語法，稱為ANSI C，作為C語言的標準。二十世纪八十年代至今的有关程式開發工具，一般都支持符合ANSI C的語法。",
  "content_4": "C語言設計目標是提供一種能以簡易的方式編譯、處理低階記憶體、產生少量的機械碼以及不需要任何執行環境支援便能執行的程式語言。C語言也很適合搭配汇编语言來使用。儘管C語言提供許多低階處理的功能，但仍保持良好跨平台的特性，以一個標準規格寫出的C語言程式可在許多電腦平台上進行編譯，甚至包含一些嵌入式处理器（微控制器或称MCU）以及超級電腦等作業平台。",
  "content_5": "",
  "content_6": ""
}]